run/0D/0D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// 1 cell mesh

convertToMeters 1;

L ${${FOAM_CASE}/caseParamsDict!L};

X0 #calc " - $L / 2.0";
X1 #calc "   $L / 2.0";

Y0 $X0;
Y1 $X1;

Z0 $X0;
Z1 $X1;

vertices
(
    ( $X0 $Y0 $Z0 )
    ( $X0 $Y0 $Z1 )
    ( $X1 $Y0 $Z0 )
    ( $X1 $Y0 $Z1 )
    ( $X0 $Y1 $Z0 )
    ( $X0 $Y1 $Z1 )
    ( $X1 $Y1 $Z0 )
    ( $X1 $Y1 $Z1 )
);

blocks
(
    hex ( 0 2 6 4 1 3 7 5 ) ( 1 1 1 ) simpleGrading ( 1 1 1 )
);

edges
(
);

//   ^ y
//   |
//   |
//   o----> x
//  /
// / z

boundary (
    empty {
        type empty;
        faces
        (
            ( 0 1 5 4 ) // left
            ( 2 6 7 3 ) // right
            ( 0 4 6 2 ) // back
            ( 1 5 7 3 ) // front
            ( 0 2 3 1 ) // bottom
            ( 4 5 7 6 ) // top
        ) ;
    }

    // left {
    //     type cyclic;
    //     neighbourPatch right;
    //     faces (
    //         ( 0 1 5 4 ) // left
    //     );
    // }
    // right {
    //     type cyclic;
    //     neighbourPatch left;
    //     faces (
    //         ( 2 6 7 3 ) // right
    //     );
    // }
    // back {
    //     type cyclic;
    //     neighbourPatch front;
    //     faces (
    //         ( 0 4 6 2 ) // back
    //     );
    // }
    // front {
    //     type cyclic;
    //     neighbourPatch back;
    //     faces (
    //         ( 1 5 7 3 ) // front
    //     );
    // }
    // bottom {
    //     type cyclic;
    //     neighbourPatch top;
    //     faces (
    //         ( 0 2 3 1 ) // bottom
    //     );
    // }
    // top {
    //     type cyclic;
    //     neighbourPatch bottom;
    //     faces (
    //         ( 4 5 7 6 ) // top
    //     );
    // }
);

mergePatchPairs ( );


// ************************************************************************* //
