run/0D/0D/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistry ${${FOAM_CASE}/caseParamsDict!chemistry};

#ifeq $chemistry pre
    #include "$FOAM_CASE/../../../etc/caseDicts/fvModels_pre"
#endif

#ifeq $chemistry act
    #include "$FOAM_CASE/../../../etc/caseDicts/fvModels_act"
#endif

// Not needed, since Ro is loaded from physicalProperties, see fvModels file
// HeterogeneousShrinkingCoreChemistryAbad
// {
//     Ro ${${FOAM_CASE}/caseParamsDict!Ro};
// }

// ************************************************************************* //
