run/0D/0D/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type basicMultiphaseSystem;

phases (solids gas);

referencePhase gas;

solids
{
    type          multicomponentPhaseModel;
    residualAlpha 1e-10;
    alphaMax        0.62;
    diameterModel constant;
    constantCoeffs
    {
        d   ${${FOAM_CASE}/caseParamsDict!particleD};
        
    }
}

gas
{
    type            multicomponentPhaseModel;
    diameterModel   none;
    residualAlpha   1e-10;
}

blending
{
    default
    {
        type   continuous;
        phase  gas;
    }
}

interfaceCompression ();
surfaceTension ();
aspectRatio ();
drag ();
virtualMass ();

heatTransfer
(
    (solids in gas)
    {
        type            Gunn;
        residualAlpha   1e-10;
    }
);

phaseTransfer {}
lift ();
wallLubrication ();
turbulentDispersion ();


// ************************************************************************* //
