run/0D/0D/0.orig/alpha.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform #calc "1 - ${${FOAM_CASE}/caseDict!alpha_solids}"; 

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
