run/0D/0D/system/volIntegrateFn
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    

\*---------------------------------------------------------------------------*/

libs            ( "libfieldFunctionObjects.so" );
type            volFieldValue;

executeControl  timeStep;
writeControl    timeStep;
writeFields     false;
log             false;

select          all;
operation       volIntegrate;

// ************************************************************************* //